app/controllers/pages_controller.rb

    def home
        @posts = Post.all
---
SELECT "posts".* FROM "posts"