app/controllers/posts_controller.rb

    def index
      if params[:tag]
        @posts = Post.tagged_with(params[:tag])
      else
        @posts = Post.all
---
SELECT "posts".* FROM "posts" INNER JOIN "associations" ON "posts"."id" = "associations"."post_id" WHERE "associations"."tag_id" = $1  [["tag_id", 36]]
SELECT "tags".* FROM "tags" INNER JOIN "associations" ON "tags"."id" = "associations"."tag_id" WHERE "associations"."post_id" = $1  [["post_id", 58]]

      def create
        @posts = Post.new(post_params)
        if @posts.save
---
INSERT INTO "posts" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Post"], ["text", "test test "], ["user_id", 11], ["created_at", "2020-12-20 13:39:03.748292"], ["updated_at", "2020-12-20 13:39:03.748292"]]

      def list

        if !params[:tag].nil? # Are we looking at a tag?
          @tag = Tag.find_by_name(params[:tag])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "tagtag"], ["LIMIT", 1]]