app/models/post.rb

  def all_tags=(names)
    self.tags = names.split(",").map do |name|
        Tag.where(name: name.strip).first_or_create!
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hi"], ["created_at", "2020-12-20 13:08:21.830416"], ["updated_at", "2020-12-20 13:08:21.830416"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["name", "hi"], ["LIMIT", 1]]

  def all_tags
    self.tags.map(&:name).join(", ")
---
SELECT "tags".* FROM "tags" INNER JOIN "associations" ON "tags"."id" = "associations"."tag_id" WHERE "associations"."post_id" = $1  [["post_id", 57]]

  def self.tagged_with(name)
    Tag.find_by_name!(name).posts
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "hey"], ["LIMIT", 1]]